** MELPA marmalade(not currently) my packages
slows down startup. obviously need this to install things
#+BEGIN_SRC emacs-lisp
  (require 'package)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  (setq package-archives '(("melpa" . "http://melpa.org/packages/")
			 ("gnu" . "http://elpa.gnu.org/packages/")))
  ;; (add-to-list 'package-archives
  ;;              '("marmalade" . "http://marmalade-repo.org/packages/") t)
  ;; Comment/uncomment this line to enable MELPA Stable if desired.  See `package-archive-priorities`
  ;; and `package-pinned-packages`. Most users will not need or want to do this.
  ;; (add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/"))
  (package-initialize)

  (package-refresh-contents)

  ;; install packages

  ;; myPackages contains a list of package names
  (defvar myPackages
    '(
      zenburn-theme
      expand-region
      multiple-cursors
      ahk-mode
      yasnippet
      use-package
      auctex-latexmk
      ivy-rich
      counsel
      bind-key
      hydra
      company
      phi-search
      interaction-log
      drag-stuff
      )
    )

  ;; Scans the list in myPackages
  ;; If the package listed is not already installed, install it
  (mapc #'(lambda (package)
	    (unless (package-installed-p package)
	      (package-install package)))
	myPackages)
#+END_SRC

#+RESULTS:
| elpy | flycheck | blacken | ein | pdf-tools | jupyter | exec-path-from-shell | zenburn-theme | expand-region | multiple-cursors | ahk-mode | yasnippet | use-package | auctex-latexmk | ivy-rich | counsel | plantuml-mode | quelpa | bind-key | lsp-mode | lsp-ui | ccls | lsp-treemacs | helm-lsp | hydra | company | helm-xref | dap-mode | org-roam | deft | phi-search | interaction-log | diredful | rg | org-noter | ivy-bibtex | org-ref | org-roam-bibtex | helm-bibtex | hide-mode-line | lsp-java | treemacs | lsp-ui | imenu | xref | drag-stuff |

